; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-29)
(:domain gripper-strips)
(:objects rooma roomb room3 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 )
(:init
(room rooma)
(room roomb)
(room room3)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
)
)
)

; plan
1. (pick ball29 rooma left)
   deleted: (at ball29 rooma) (free left)
   added: (carry ball29 left)
   goals met: 10 of 29
2. (pick ball28 rooma right)
   deleted: (at ball28 rooma) (free right)
   added: (carry ball28 right)
   goals met: 10 of 29
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 10 of 29
4. (drop ball28 room3 right)
   deleted: (carry ball28 right)
   added: (at ball28 room3) (free right)
   goals met: 11 of 29
5. (drop ball29 room3 left)
   deleted: (carry ball29 left)
   added: (at ball29 room3) (free left)
   goals met: 12 of 29
6. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 12 of 29
7. (pick ball27 rooma left)
   deleted: (at ball27 rooma) (free left)
   added: (carry ball27 left)
   goals met: 12 of 29
8. (pick ball26 rooma right)
   deleted: (at ball26 rooma) (free right)
   added: (carry ball26 right)
   goals met: 12 of 29
9. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 12 of 29
10. (drop ball26 room3 right)
   deleted: (carry ball26 right)
   added: (at ball26 room3) (free right)
   goals met: 13 of 29
11. (drop ball27 room3 left)
   deleted: (carry ball27 left)
   added: (at ball27 room3) (free left)
   goals met: 14 of 29
12. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 29
13. (pick ball25 rooma left)
   deleted: (at ball25 rooma) (free left)
   added: (carry ball25 left)
   goals met: 14 of 29
14. (pick ball24 rooma right)
   deleted: (at ball24 rooma) (free right)
   added: (carry ball24 right)
   goals met: 14 of 29
15. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 14 of 29
16. (drop ball24 room3 right)
   deleted: (carry ball24 right)
   added: (at ball24 room3) (free right)
   goals met: 15 of 29
17. (drop ball25 room3 left)
   deleted: (carry ball25 left)
   added: (at ball25 room3) (free left)
   goals met: 16 of 29
18. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 29
19. (pick ball23 rooma left)
   deleted: (at ball23 rooma) (free left)
   added: (carry ball23 left)
   goals met: 16 of 29
20. (pick ball22 rooma right)
   deleted: (at ball22 rooma) (free right)
   added: (carry ball22 right)
   goals met: 16 of 29
21. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 29
22. (drop ball22 room3 right)
   deleted: (carry ball22 right)
   added: (at ball22 room3) (free right)
   goals met: 17 of 29
23. (drop ball23 room3 left)
   deleted: (carry ball23 left)
   added: (at ball23 room3) (free left)
   goals met: 18 of 29
24. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 18 of 29
25. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 18 of 29
26. (pick ball20 rooma right)
   deleted: (at ball20 rooma) (free right)
   added: (carry ball20 right)
   goals met: 18 of 29
27. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 18 of 29
28. (drop ball20 room3 right)
   deleted: (carry ball20 right)
   added: (at ball20 room3) (free right)
   goals met: 19 of 29
29. (drop ball21 room3 left)
   deleted: (carry ball21 left)
   added: (at ball21 room3) (free left)
   goals met: 20 of 29
30. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 20 of 29
31. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 20 of 29
32. (pick ball18 rooma right)
   deleted: (at ball18 rooma) (free right)
   added: (carry ball18 right)
   goals met: 20 of 29
33. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 20 of 29
34. (drop ball19 room3 left)
   deleted: (carry ball19 left)
   added: (at ball19 room3) (free left)
   goals met: 21 of 29
35. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 21 of 29
36. (drop ball18 roomb right)
   deleted: (carry ball18 right)
   added: (at ball18 roomb) (free right)
   goals met: 22 of 29
37. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 29
38. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 22 of 29
39. (pick ball16 rooma right)
   deleted: (at ball16 rooma) (free right)
   added: (carry ball16 right)
   goals met: 22 of 29
40. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 29
41. (drop ball16 roomb right)
   deleted: (carry ball16 right)
   added: (at ball16 roomb) (free right)
   goals met: 23 of 29
42. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 24 of 29
43. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 29
44. (pick ball15 rooma left)
   deleted: (at ball15 rooma) (free left)
   added: (carry ball15 left)
   goals met: 24 of 29
45. (pick ball14 rooma right)
   deleted: (at ball14 rooma) (free right)
   added: (carry ball14 right)
   goals met: 24 of 29
46. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 29
47. (drop ball14 roomb right)
   deleted: (carry ball14 right)
   added: (at ball14 roomb) (free right)
   goals met: 25 of 29
48. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 26 of 29
49. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 29
50. (pick ball13 rooma left)
   deleted: (at ball13 rooma) (free left)
   added: (carry ball13 left)
   goals met: 26 of 29
51. (pick ball12 rooma right)
   deleted: (at ball12 rooma) (free right)
   added: (carry ball12 right)
   goals met: 26 of 29
52. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 29
53. (drop ball12 roomb right)
   deleted: (carry ball12 right)
   added: (at ball12 roomb) (free right)
   goals met: 27 of 29
54. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 28 of 29
55. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 29
56. (pick ball11 rooma left)
   deleted: (at ball11 rooma) (free left)
   added: (carry ball11 left)
   goals met: 28 of 29
57. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 29
58. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 29 of 29
